РазработкаОУМобильная/src/DataProcessors/УГМК_ВводЧисла/УГМК_ВводЧисла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УГМК_ВводЧисла</name>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСтрока</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

РазработкаОУМобильная/src/DataProcessors/УГМК_ВводЧисла/Forms/ФормаМобильная/Module.bsl
&НаКлиенте
Процедура КомандаВвод(Команда)
	Результат = Новый Структура;
	
	Результат.Вставить("Команда","РезультатВводаЧисла");
	
	Если Объект.ЭтоСтрока тогда
		Результат.Вставить("Значение", СтрокаВвода);
	иначе
		Результат.Вставить("Значение", Число( "0"+СтрокаВвода));
	КонецЕсли;
	Результат.Вставить("ИмяРеквизита", Объект.ИмяРеквизита);
	
	//Оповестить( "УГМК_РезультатВводаЧисла", Результат);
	Закрыть( Результат);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)
	СтрокаВвода = Лев( СтрокаВвода, СтрДлина( СтрокаВвода)-1);
КонецПроцедуры

&НаКлиенте
Процедура Команда0(Команда)
	СтрокаВвода = СтрокаВвода + "0";
КонецПроцедуры

&НаКлиенте
Процедура Команда00(Команда)
	СтрокаВвода = СтрокаВвода + "00";
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	СтрокаВвода = СтрокаВвода + "1";
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	СтрокаВвода = СтрокаВвода + "2";
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	СтрокаВвода = СтрокаВвода + "3";
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	СтрокаВвода = СтрокаВвода + "4";
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	СтрокаВвода = СтрокаВвода + "5";
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	СтрокаВвода = СтрокаВвода + "6";
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	СтрокаВвода = СтрокаВвода + "7";
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	СтрокаВвода = СтрокаВвода + "8";
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	СтрокаВвода = СтрокаВвода + "9";
КонецПроцедуры

&НаКлиенте
Процедура Команда_(Команда)
	Поз = Найти( СтрокаВвода, ","); 
	Если Поз <> 0 тогда 
		СтрокаВвода = Лев( СтрокаВвода, Поз);
	иначе
		СтрокаВвода = СтрокаВвода + ",";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Свойство("Заголовок")) Тогда
		Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = Параметры.Заголовок;
		КонецЕсли;	
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств( Объект, Параметры);
	Если ЗначениеЗаполнено( Объект.Значение) или ЗначениеЗаполнено( Объект.ЗначениеСтр) тогда
		Если Объект.ЭтоСтрока тогда
			СтрокаВвода = Объект.ЗначениеСтр;
		иначе                                       
			СтрокаВвода = Формат( Объект.Значение, "ЧГ=0");
		КонецЕсли;
	КонецЕсли;
	
	//Если Объект.ЭтоСтрока тогда
	//	Элементы.Символы.Видимость = Истина;
	//	Элементы.СтрокаВвода.Ширина = 53;
	//иначе
	//	Элементы.Символы.Видимость = Ложь;
	//	Элементы.СтрокаВвода.Ширина = 42;
	//КонецЕсли;
	//
	//Элементы.СтрокаВвода.РежимПароля = Объект.РежимПароля;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистить(Команда)
	СтрокаВвода = "";
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗвездочка(Команда)
	СтрокаВвода = СтрокаВвода + "*";
КонецПроцедуры

&НаКлиенте
Процедура КомандаПробел(Команда)
	СтрокаВвода = СтрокаВвода + " ";
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочкаСЗапятой(Команда)
	СтрокаВвода = СтрокаВвода + ";";
КонецПроцедуры

&НаКлиенте
Процедура КомандаМинус(Команда)
	СтрокаВвода = СтрокаВвода + "-";
КонецПроцедуры

&НаКлиенте
Процедура КомандаЧерта(Команда)
	СтрокаВвода = СтрокаВвода + "/";
КонецПроцедуры


&НаКлиенте
Процедура Команда11(Команда)
	СтрокаВвода = СтрокаВвода + ":";
КонецПроцедуры
